Revit 2027 API
PolymeshTopology.GetFacets Method
 Returns a definitions of all facets of the polymesh
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<PolymeshFacet> GetFacets()
Public Function GetFacets As IList(Of PolymeshFacet)
public:
IList<PolymeshFacet^>^ GetFacets()
member GetFacets : unit -> IList<PolymeshFacet>
Return Value
IList<PolymeshFacet>
 An array of PolymeshFacet instances, each of which represents one facet defined by 3 vertices of the polymesh.
See Also
Reference
PolymeshTopology Class
Autodesk.Revit.DB Namespace